<?php
// +----------------------------------------------------------------------
// | QINGDAO YINGWANG Co., Ltd.
// +----------------------------------------------------------------------
// | Copyright (c) 2014 http://www.xzhiliao.com All rights reserved.
// +----------------------------------------------------------------------
// | Author: gaov <qdgaov@163.com>
// +----------------------------------------------------------------------
// | Create Date: 2014-12-15
// +----------------------------------------------------------------------

$config = array(
	/* 默认配置 */
	'DEFAULT_CONTROLLER'=>'api',
	'DEFAULT_METHOD'    =>'index',

	/* 数据库设置 */
    'DB_TYPE'               =>  '',     // 数据库类型
    'DB_HOST'               =>  '', 	// 服务器地址
    'DB_NAME'               =>  '',     // 数据库名
    'DB_USER'               =>  '',     // 用户名
    'DB_PWD'                =>  '',     // 密码
    'DB_PORT'               =>  '',     // 端口
    'DB_PREFIX'             =>  '',     // 数据库表前缀
    'DB_CHARSET'            =>  'utf8', // 数据库编码默认采用utf8
);